In [1]:
import pandas as pd

datos = {
    'nombre':   ['Ana', 'Bob', 'Clara', 'Diego', 'Eva'],
    'edad':     [25, 30, 22, None, 28],
    'ciudad':   ['Madrid', 'Lima', 'Bogotá', 'Medellín', None],
    'producto': ['Laptop', 'Teléfono', 'Tablet', 'Laptop', 'Tablet'],
    'precio':   [1200, 800, 300, 1150, None],
    'stock':    [10, 15, 5, 8, 0]
}

df = pd.DataFrame(datos, index=['a', 'b', 'c', 'd', 'e'])

# Guarda el dataset para ejercicios de lectura/escritura
df.to_csv('actividad_semana4.csv', index=True)
df

  nombre  edad    ciudad  producto  precio  stock
a    Ana  25.0    Madrid    Laptop  1200.0     10
b    Bob  30.0      Lima  Teléfono   800.0     15
c  Clara  22.0    Bogotá    Tablet   300.0      5
d  Diego   NaN  Medellín    Laptop  1150.0      8
e    Eva  28.0      None    Tablet     NaN      0

1.Series — crear y operar

In [2]:
import pandas as pd

# Desde lista
s1 = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'], name='valores')
print("Series desde lista:\n", s1)

# Desde diccionario
s2 = pd.Series({'Ana':25, 'Bob':30, 'Clara':22, 'Diego':35})
print("\nSeries desde diccionario:\n", s2)

# Acceder y modificar
print("\nAcceso s1['b'] =", s1['b'])
s1['c'] = 99
print("Después de modificar:\n", s1)

# Operación matemática
print("\nMultiplicado por 2:\n", s1 * 2)

Series desde lista:
 a    10
b    20
c    30
d    40
Name: valores, dtype: int64

Series desde diccionario:
 Ana      25
Bob      30
Clara    22
Diego    35
dtype: int64

Acceso s1['b'] = 20
Después de modificar:
 a    10
b    20
c    99
d    40
Name: valores, dtype: int64

Multiplicado por 2:
 a     20
b     40
c    198
d     80
Name: valores, dtype: int64

2) DataFrame — crear y explorar

In [3]:
datos = {
    'nombre': ['Ana', 'Bob', 'Clara', 'Diego', 'Eva'],
    'edad': [25, 30, 22, None, 28],
    'ciudad': ['Madrid', 'Lima', 'Bogotá', 'Medellín', None],
    'producto': ['Laptop', 'Teléfono', 'Tablet', 'Laptop', 'Tablet'],
    'precio': [1200, 800, 300, 1150, None],
    'stock': [10, 15, 5, 8, 0]
}
df = pd.DataFrame(datos, index=['a', 'b', 'c', 'd', 'e'])
df
print("Columna 'nombre':\n", df['nombre'])
print("\nloc['c']:\n", df.loc['c'])
print("\niloc[2]:\n", df.iloc[2])

Columna 'nombre':
 a      Ana
b      Bob
c    Clara
d    Diego
e      Eva
Name: nombre, dtype: object

loc['c']:
 nombre       Clara
edad          22.0
ciudad      Bogotá
producto    Tablet
precio       300.0
stock            5
Name: c, dtype: object

iloc[2]:
 nombre       Clara
edad          22.0
ciudad      Bogotá
producto    Tablet
precio       300.0
stock            5
Name: c, dtype: object

3) Operaciones básicas

In [4]:
df['precio_descuento'] = (df['precio'] * 0.9).round(2)
df['stock_duplicado'] = df['stock'] * 2
df

,nombre,edad,ciudad,producto,precio,stock,precio_descuento,stock_duplicado
a,Ana,25.0,Madrid,Laptop,1200.0,10,1080.0,20
b,Bob,30.0,Lima,Teléfono,800.0,15,720.0,30
c,Clara,22.0,Bogotá,Tablet,300.0,5,270.0,10
d,Diego,NaN,Medellín,Laptop,1150.0,8,1035.0,16
e,Eva,28.0,None,Tablet,NaN,0,NaN,0

4) Manejo de datos faltantes

In [5]:
print("Nulos:\n", df.isna())
print("\nConteo por columna:\n", df.isna().sum())

df_fill = df.copy()
df_fill['edad'] = df_fill['edad'].fillna(0).astype(int)
df_fill['ciudad'] = df_fill['ciudad'].fillna('Desconocido')
df_fill

Nulos:
    nombre   edad  ciudad  producto  precio  stock  precio_descuento  \
a   False  False   False     False   False  False             False
b   False  False   False     False   False  False             False
c   False  False   False     False   False  False             False
d   False   True   False     False   False  False             False
e   False  False    True     False    True  False              True

   stock_duplicado
a            False
b            False
c            False
d            False
e            False

Conteo por columna:
 nombre              0
edad                1
ciudad              1
producto            0
precio              1
stock               0
precio_descuento    1
stock_duplicado     0
dtype: int64

,nombre,edad,ciudad,producto,precio,stock,precio_descuento,stock_duplicado
a,Ana,25,Madrid,Laptop,1200.0,10,1080.0,20
b,Bob,30,Lima,Teléfono,800.0,15,720.0,30
c,Clara,22,Bogotá,Tablet,300.0,5,270.0,10
d,Diego,0,Medellín,Laptop,1150.0,8,1035.0,16
e,Eva,28,Desconocido,Tablet,NaN,0,NaN,0

5) Selección y filtrado

In [6]:
df[df['precio'] > 500]

,nombre,edad,ciudad,producto,precio,stock,precio_descuento,stock_duplicado
a,Ana,25.0,Madrid,Laptop,1200.0,10,1080.0,20
b,Bob,30.0,Lima,Teléfono,800.0,15,720.0,30
d,Diego,NaN,Medellín,Laptop,1150.0,8,1035.0,16

In [7]:
df[(df['producto'] == 'Laptop') & (df['stock'] > 5)]

,nombre,edad,ciudad,producto,precio,stock,precio_descuento,stock_duplicado
a,Ana,25.0,Madrid,Laptop,1200.0,10,1080.0,20
d,Diego,NaN,Medellín,Laptop,1150.0,8,1035.0,16

6) Ordenar datos

In [8]:
df.sort_values('edad')

,nombre,edad,ciudad,producto,precio,stock,precio_descuento,stock_duplicado
c,Clara,22.0,Bogotá,Tablet,300.0,5,270.0,10
a,Ana,25.0,Madrid,Laptop,1200.0,10,1080.0,20
e,Eva,28.0,None,Tablet,NaN,0,NaN,0
b,Bob,30.0,Lima,Teléfono,800.0,15,720.0,30
d,Diego,NaN,Medellín,Laptop,1150.0,8,1035.0,16

In [9]:
df.sort_values('precio', ascending=False, na_position='last')

,nombre,edad,ciudad,producto,precio,stock,precio_descuento,stock_duplicado
a,Ana,25.0,Madrid,Laptop,1200.0,10,1080.0,20
d,Diego,NaN,Medellín,Laptop,1150.0,8,1035.0,16
b,Bob,30.0,Lima,Teléfono,800.0,15,720.0,30
c,Clara,22.0,Bogotá,Tablet,300.0,5,270.0,10
e,Eva,28.0,None,Tablet,NaN,0,NaN,0

7) Estadísticas básicas

In [10]:
df.describe()

        edad       precio     stock  precio_descuento  stock_duplicado
count   4.00     4.000000   5.00000          4.000000         5.000000
mean   26.25   862.500000   7.60000        776.250000        15.200000
std     3.50   415.080314   5.59464        373.572282        11.189281
min    22.00   300.000000   0.00000        270.000000         0.000000
25%    24.25   675.000000   5.00000        607.500000        10.000000
50%    26.50   975.000000   8.00000        877.500000        16.000000
75%    28.50  1162.500000  10.00000       1046.250000        20.000000
max    30.00  1200.000000  15.00000       1080.000000        30.000000

In [12]:
df['producto'].value_counts()

producto
Laptop      2
Tablet      2
Teléfono    1
Name: count, dtype: int64

8) Leer y guardar datos

In [13]:
df.to_csv('actividad_semana4.csv', index=True)
df_leido = pd.read_csv('actividad_semana4.csv', index_col=0)
df_leido.head()

,nombre,edad,ciudad,producto,precio,stock,precio_descuento,stock_duplicado
a,Ana,25.0,Madrid,Laptop,1200.0,10,1080.0,20
b,Bob,30.0,Lima,Teléfono,800.0,15,720.0,30
c,Clara,22.0,Bogotá,Tablet,300.0,5,270.0,10
d,Diego,NaN,Medellín,Laptop,1150.0,8,1035.0,16
e,Eva,28.0,NaN,Tablet,NaN,0,NaN,0

In [14]:
df[['nombre', 'producto', 'precio', 'stock']].to_csv('resumen_ventas.csv', index=True)

9) Ejercicio integrado

In [15]:
df_int = df.copy()
df_int['precio_descuento'] = (df_int['precio'] * 0.9).round(2)
df_int = df_int[df_int['stock'] > 5]
df_int = df_int.sort_values('precio_descuento', ascending=False)
df_int.to_csv('inventario_procesado.csv', index=True)
df_int

,nombre,edad,ciudad,producto,precio,stock,precio_descuento,stock_duplicado
a,Ana,25.0,Madrid,Laptop,1200.0,10,1080.0,20
d,Diego,NaN,Medellín,Laptop,1150.0,8,1035.0,16
b,Bob,30.0,Lima,Teléfono,800.0,15,720.0,30